app/controllers/cities_controller.rb

    def find_city
        @city = City.find(params[:id])
---
SELECT "cities".* FROM "cities" WHERE "cities"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]