app/controllers/sessions_controller.rb

  def create

    @user = User.find_by(user_name: params[:user_name])
---
SELECT "users".* FROM "users" WHERE "users"."user_name" = ? LIMIT ?  [["user_name", "jhuang9240"], ["LIMIT", 1]]