app/controllers/users_controller.rb

    def profile
        @user = User.find_by(id: session[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]

    def create
        user = User.create(user_params)
---
INSERT INTO "users" ("first_name", "last_name", "user_name", "password_digest", "bio", "photo", "hometown", "age", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

    def edit
        @user  = User.find_by(id: session[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def update
        @user.update(user_params)
---
UPDATE "users" SET "user_name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["user_name", "superdog1"], ["updated_at", "2020-02-11 18:32:28.992227"], ["id", 4]]